ParkerSD/FlashBlaster/nRF5_SDK_16.0.0_98a08e2/examples/ble_peripheral/ble_app_uart/pca10056/s140/ses/system.c

#include <stdlib.h>
#include <stdio.h>
#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf.h"
#include "ble_hci.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "nrf_sdh.h"
#include "nrf_sdh_soc.h"
#include "nrf_sdh_ble.h"
#include "nrf_ble_gatt.h"
#include "nrf_ble_qwr.h"
#include "app_timer.h"
#include "ble_nus.h"
#include "app_uart.h"
#include "app_util_platform.h"
#include "bsp_btn_ble.h"
#include "nrf_pwr_mgmt.h"
#include "nrf_drv_twi.h"
#include "nrfx_twi.h"
#include "nrfx_twim.h"
#include "nrf_drv_spi.h"
#include "oled.h"
#include "ssd1351.h" 
#include "fonts.h" 
#include "button.h" 
#include "system.h"
#include "flash.h"


#define ADDR_NUM_PROJECTS 0
#define ADDR_PROJECT_PTR_FIRST 4
#define PROJECT_SIZE 24 //project size with first pointer
#define CHIP_SIZE 28 
#define WORD_SIZE 4
#define MAX_STRING_SIZE 16
#define DIRECTORY_OFFSET 32
#define PROJECT_OFFSET 20

#define SYS_ system_singleton->
#define L_ list_singleton->
#define REC_ recents_singleton-> 

#define curr_font small_font

recents_struct* recents_singleton;
list_struct* list_singleton;
system_struct* system_singleton; //TODO init global system stuct based on file system


uint8_t projectIterator = 0; 
uint8_t chipIterator = 0; 
uint8_t fileIterator = 0;
uint8_t selectedProject; 
 

// Hardcoded Values
char systemFirmware[] = {"FlashBlaster V0"}; 

char projectHeader[] = {"Select Project:"}; 
char* projectNames[10] = {"Quake", "Jeep", "Nikola", "Tesla", "SpaceX", "Rockford Internal", "Subaru", "Nissan", "Ducati", "Toyota"}; // TODO: chop and hardcode as appropriate structs 

char chipHeader[] = {"Select Chip:"}; // or Project Name
char* chipNames[10] = {"Atmel", "Nordic", "STM32", "Cirrus Logic", "NXP", "Renesas", "Pic32", "AVR", "Silicon Labs", "Qualcomm"}; // 

char fileHeader[] = {"Select File:"}; // or Chip Name
char* fileNames[10] = {"pickthis.bin", "promotion.bin", "Bug.bin", "this.hex", "that.bin", "banshee.bin", "pastry.elf", "killme.hex", "reget.bin", "mistakes.hex"}; 


recents_struct* recents_init(void)
{
    recents_struct* recentsX = malloc(sizeof(recents_struct));
    recentsX->file0 = NULL;
    recentsX->file1 = NULL;
    recentsX->file2 = NULL;
    recentsX->file3 = NULL;
    return recentsX;
}


void push_file_to_recents(void) //shift recent files, pushing oldest off stack
{
    REC_ file0 = L_ recent; // member recent never assigned value
    REC_ file1 = REC_ file0;
    REC_ file2 = REC_ file1;
    REC_ file3 = REC_ file2;
}


void clear_screen(void)
{
    SSD1351_fill(COLOR_BLACK);
    SSD1351_update();
    L_ boxPresent = false;
    L_ headerPresent = false;
}


void draw_selection_box(void) // top left corner of full width box = point (0, y) 
{
    //SSD1351_draw_rect(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color)
    SSD1351_draw_rect(2, 45, 124, 30, COLOR_BLUE);
    SSD1351_update();
    L_ boxPresent = true; 
}


void draw_header(void)
{
    SSD1351_set_cursor(1,1);
    SSD1351_printf(COLOR_WHITE, small_font, L_ header);
    SSD1351_update();
    L_ headerPresent = true;
}


void draw_initial_screen(void)
{   
   L_ currentList = project;
   L_ header = projectHeader; 
   L_ item0 = SYS_ project_first->project_name;
   L_ item1 = SYS_ project_first->project_next->project_name;
   L_ item2 = SYS_ project_first->project_next->project_next->project_name;
// L_ item3 = SYS_ project_first->project_next->project_next->project_next->project_name;
// L_ item4 = SYS_ project_first->project_next->project_next->project_next->project_next->project_name;

    recents_singleton = recents_init();
    
    clear_screen();
    draw_selection_box();
    draw_header();
    SSD1351_set_cursor(10,57);
    SSD1351_printf(COLOR_WHITE, curr_font, L_ item0);
    SSD1351_set_cursor(10,83);
    SSD1351_printf(COLOR_WHITE, curr_font, L_ item1);
    SSD1351_set_cursor(10,105);
    SSD1351_printf(COLOR_WHITE, curr_font, L_ item2);
    SSD1351_update();
}

list_struct* list_new(void)
{
    list_struct* listX = malloc(sizeof(list_struct)); 
    
    listX->currentList = NULL;
    listX->header = NULL;
    listX->recent = NULL;
    listX->item0 = NULL; // based on button presses the order will change and items will be rerendered
    listX->item1 = NULL; 
    listX->item2 = NULL; 
    listX->item3 = NULL; 
    listX->item4 = NULL; 

    listX->boxPresent = false; 
    listX->headerPresent = false; 

    return listX;
}

void list_init(void)
{
    list_singleton = list_new();
}

//TODO: implement set_current_project() function based on selected item, same for chip and file, render name strings only 

system_struct* system_new(void) //TODO file system, shoulf be constructed in Flash, only NAMES fetched from flash here for later display (CURRENTLY INITING WHOLE FILESSYTEM IN RAM)
{                                                            
    system_struct* systemX = malloc(sizeof(system_struct)); 
    systemX->system_name = firmware_version_fetch(); 
    systemX->projects_total = NULL;
    systemX->project_first = NULL; //project_create();
    systemX->project_curr = 0;

    return systemX;
}


uint32_t bytes_to_word(uint8_t* bytes, uint32_t word) // bytes stored MSB 
{
    word = *bytes << 24 | *(bytes + 1) << 16 | *(bytes + 2) << 8 | *(bytes + 3);

    return word; 
}

void chips_sync(int8_t selectedItem)
{
    //index project                                        
    project_struct* project_selected = project_list_index(selectedItem); // NOTE: passing int8_t argument to int parameter
    uint16_t total_chips = project_selected->chip_num;
   
    //NOTE Store project flash address in project_struct
     
    if(total_chips != 0)
    { 
        uint32_t chip_address_start = project_selected->chip_first_addr; // get address of chip list start 
        char* chip_buffer = malloc(sizeof(char[CHIP_SIZE]));
        flash_read(chip_buffer, chip_address_start, CHIP_SIZE); // TODO program hangs here, investigate flash chip, problem with address being to remote
        project_selected->chip_first = chip_new(chip_buffer); // create first project(head of list) 
          
          //NOTE HOW TO FIND CHIP ADDRESSES IN FLASH? need to buffer all chip addresses into project struct

//        uint32_t total_chips_length = WORD_SIZE * total_chips;
//        uint8_t chip_addr[total_chips_length]; // array sized for all chip addresses 
//        flash_read(chip_addr, chip_address_start, total_chips_length); // buffer for all chip addresses 
        
        // create first chip in RAM, extract to function
        //char* chip_buffer = malloc(sizeof(char[CHIP_SIZE])); //TODO FREE,  name string plus num_chips malloc 
        //uint32_t current_addr =  chip_addr[0]  << 24 | chip_addr[1] << 16 | chip_addr[2] << 8 | chip_addr[3]; // shift bytes into 32bit int
        //flash_read(chip_buffer, chip_address_start, CHIP_SIZE);
        //project_selected->chip_first = chip_new(chip_buffer); // create first project(head of list) 

        // create remainder of projects, first proejct already made 
        for(int i = 0; i < total_chips; i++) 
        {   
            // convert 4 bytes into 32bit number 
//            current_addr = chip_addr[0 + (i*4)]  << 24 | chip_addr[1 + (i*4)] << 16 | chip_addr[2 + (i*4)] << 8 | chip_addr[3 + (i*4)];
//            flash_read(chip_buffer, current_addr, CHIP_SIZE);// read project data 
//            chip_new(chip_buffer);
        }
    }
    else
    {
        project_selected->chip_first = chip_create(); 
        project_selected->chip_first->file_first = file_create();
    }
    
