ParkerSD/FlashBlaster/nRF5_SDK_16.0.0_98a08e2/examples/ble_peripheral/ble_app_uart/pca10056/s140/ses/system.c
    // read num chips from selected item project address 
    
    // buffer all chip addresses 
    // buffer each chip and create structs
    // assign chips to each chip_next in order 
}


chip_struct* chip_new(char* data)
{

}


void projects_sync(void) //sync projects from flash
{
    //determine number of projects from directory value
    uint8_t* num_projects = malloc(sizeof(int)); //TODO FREE
    flash_read(num_projects, ADDR_NUM_PROJECTS, WORD_SIZE); // read num projects // flash_read(uint8_t* buffer_rx, uint32_t start_addr, size_t DATA_SIZE_BYTES)
    uint32_t project_count = bytes_to_word(num_projects, project_count); // function to convert byte array to 32bit word 
    SYS_ projects_total = project_count; // populate system struct with project num value from flash

    if(project_count != 0)
    {   
        // buffer all project pointers 
        uint32_t total_projects_length = project_count * WORD_SIZE; 
        uint8_t project_addr[total_projects_length]; // array sized for all project addresses 
        flash_read(project_addr, ADDR_PROJECT_PTR_FIRST, total_projects_length); // buffer for all project addresses
        
        // create first project in RAM, extract to function
        char* project_buffer = malloc(sizeof(char[PROJECT_SIZE])); //TODO FREE,  name string plus num_chips malloc 
        uint32_t current_addr = project_addr[0] << 24 | project_addr[1] << 16 | project_addr[2] << 8 | project_addr[3]; // shift bytes into 32bit int
        flash_read(project_buffer, current_addr, PROJECT_SIZE);
        SYS_ project_first = project_new(project_buffer); // create first project(head of list) 

        // create remainder of projects, first proejct already made 
        for(int i = 0; i < project_count; i++) 
        {   
            // convert 4 bytes into 32bit number 
            current_addr = project_addr[0 + (i*4)]  << 24 | project_addr[1 + (i*4)] << 16 | project_addr[2 + (i*4)] << 8 | project_addr[3 + (i*4)];
            flash_read(project_buffer, current_addr, PROJECT_SIZE);// read project data 
            project_new(project_buffer);
        }
        // char* project[project_count]; // string of project names if needed
    }
    else
    {
        SYS_ project_first = project_create(); // create empty project - chip - file structures
        SYS_ project_first->chip_first = chip_create();
        SYS_ project_first->chip_first->file_first = file_create();
    }
}

project_struct* project_list_index(int index) 
{ 
    project_struct* projectN;
    projectN = SYS_ project_first; 

    for(int i = 1; i < index; i++) // minus 1 loop since file_first was already factored in
    {
        projectN = projectN->project_next; 
    }
    return projectN; 
}


project_struct* project_new(char* data) //input 24 byte project data, string, num_chips, and chip_first address
{
    project_struct* projectY = project_create(); //create project
   
    projectY->project_name = project_name_fetch(data);  // send in payload, fetch from flash
    projectY->chip_num = *(data+16) << 24 | *(data+17) << 16 | *(data+18) << 8 | *(data+19);//TODO: chip_num_fetch(data) - last 4 bytes of 20 bytes;
    projectY->project_next = NULL;
    projectY->chip_first = NULL; 
    projectY->chip_first_addr = *(data+20) << 24 | *(data+21) << 16 | *(data+22) << 8 | *(data+23); // address starts at 20th byte of project
    
    if(SYS_ project_curr != 0) //push node, add to project_next
    {  
        int olderSiblingIndex = (SYS_ project_curr - 1);  
        project_struct* projectZ = project_list_index(olderSiblingIndex);    //index olderSibling and assign project to project_next node of last created project, older sibling is at index of SYS_ project_num
        projectZ->project_next = projectY;  
    }
  
    projectY->project_index = SYS_ project_curr; // NOTE: POSSIBLE BUG HERE, should index from zero
    SYS_ project_curr += 1; 

    return projectY; //should return newly created to global
}

void flash_init(void)
{   
    // ADDR_NUM_PROJECTS 0
    // ADDR_PROJECT_PTR_FIRST 4

    // init flash for test below 
    flash_erase(0, NRF_QSPI_ERASE_LEN_4KB); // erase all 

    //DIRECTORY
    uint8_t directory[32] = {0, 0, 0, 3, 0, 0, 0, 32, 0, 0, 0, 100, 0, 0, 0, 200, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}; // num projects: 1, first project address: 32
    flash_write(directory, 0, 32); // write test directory

    //PROJECT 1 - 24 bytes (including first chip addr) 
    uint8_t project_string_test0[] = {"project0"};
    uint8_t chip_num_test[WORD_SIZE] = {0, 0, 0, 1};
    uint8_t chip_ptr_first_test[WORD_SIZE] = {0, 0, 2, 0}; //address 600 when bit shifted
    flash_write(project_string_test0, 32, sizeof(char[MAX_STRING_SIZE])); // name sting 16 bytes long 
    flash_write(chip_num_test, 48, WORD_SIZE); // chip num 4 bytes, address 48 (after string) 
    flash_write(chip_ptr_first_test, 52, WORD_SIZE); // write first chip ptr after chip_num value of first project
    //CHIP 1 - 28 bytes (including first file addr) 
    uint8_t chip_string_test0[] = {"chip0           "}; //16 bytes
    uint8_t chip_type_ID[WORD_SIZE] = {0, 0, 7, 0}; 
    uint8_t files_num[WORD_SIZE] = {0, 0, 7, 0}; 
    uint8_t files_first_addr[WORD_SIZE] = {0, 0, 255, 255}; 
    flash_write(chip_string_test0, 512, sizeof(char[MAX_STRING_SIZE]));
    flash_write(chip_type_ID, 528, WORD_SIZE);
    flash_write(files_num, 532, WORD_SIZE);
    flash_write(files_first_addr, 536, WORD_SIZE);
    
    //PROJECT 2
    uint8_t project_string_test1[] = {"project1"};
    flash_write(project_string_test1, 100, sizeof(char[MAX_STRING_SIZE])); // name string 16 bytes long 
    //PROJECT 3 
    uint8_t project_string_test2[] = {"project2"};
    flash_write(project_string_test2, 200, sizeof(char[MAX_STRING_SIZE])); // name string 16 bytes long 
    
}


void system_init(void) // create global system struct and read directory info from flash, create project structs 
{   
    system_singleton = system_new();  
    flash_init(); 
    projects_sync(); 
}


char* firmware_version_fetch(void)
{
    //fetch FW version from flash 
    return systemFirmware;
}


char* project_name_fetch(char* data)
{
    char* name_string = malloc(sizeof(char[MAX_STRING_SIZE])); //TODO FREE 
    memcpy(name_string, data, MAX_STRING_SIZE); //16 bytes = max string length 
    return name_string;
}


char* chip_name_fetch(void)
{
    //fetch chip name from flash 
    return chipNames[chipIterator];
}


char* file_name_fetch(void)
{
    //fetch file name from flash 
    return fileNames[fileIterator]; 
}

chip_struct* chip_parent_fetch(void)
{
    // TODO: fetch chip_parent member from newly create file
    // read external flash here
    return NULL;
}

project_struct* project_parent_fetch(void)
{
    // TODO: fetch project_parent member from newly created chip
    // read external flash here
    return NULL; 
}


