ParkerSD/FlashBlaster/nRF5_SDK_16.0.0_98a08e2/examples/ble_peripheral/ble_app_uart/pca10056/s140/ses/system.c
//TODO: create file_new, project_new, chip_new functions for adding nodes, add menu item to allow creation, at bottom of menu? 

file_struct* file_list_index(file_struct* file, int index) 
{ 
    file_struct* fileN;
    fileN = file->chip_parent->file_first; 

    for(int i = 1; i < index; i++) // minus 1 loop since file_first was already factored in
    {
        fileN = fileN->file_next; 
    }
    return fileN; 
}


file_struct* file_new(void) //fetches file from Flash and adds to linked list in RAM 
{   
    file_struct* fileY = file_create(); //create file
    
    fileY->chip_parent = chip_parent_fetch(); // data needs to be sent in payload and fetched from flash
    fileY->file_name = file_name_fetch();  // send in payload, fetch from flash
    fileY->file_next = NULL;
    fileY->file_data = NULL; // send in payload, pointer to data in flash 
    
    fileY->file_index = fileY->chip_parent->file_num; // update file index
    fileY->chip_parent->file_num += 1; //increment file counter on chip_parent
    

    if(fileY->file_index != 0) //push node, add to file_next of last file
    {   
        int olderSiblingIndex = fileY->file_index - 1;  // older sibling is one made previously
        file_struct* fileZ = file_list_index(fileY, olderSiblingIndex); 
        fileZ->file_next = fileY; //assign newly created file as file_next of last file
    }

    return fileY; //should return newly created to global
}


/*
    chip_struct* chip_parent; 
    uint8_t file_index; 
    file_struct* file_next; 
    char* file_name; 
    uint8_t* file_data; // pointer to program data
*/
file_struct* file_create(void)
{
    file_struct* fileX = malloc(sizeof(file_struct)); 
    
    fileX->file_name = "Empty"; //file_name_fetch(); 
    fileX->file_index = NULL;
    fileX->file_next = NULL;
    fileX->file_data = NULL;
    fileX->chip_parent = NULL;
 
    return fileX;
}


/*
    project_struct* project_parent;
    char* chip_name; 
    uint8_t chip_index; 
    chip_struct* chip_next; 
    uint8_t file_num; //total num of files associated with the chip 
    file_struct* file_first; // pointer to head
*/
chip_struct* chip_create(void) //TODO: render only existing files 
{
    chip_struct* chipX = malloc(sizeof(chip_struct));
    
    chipX->chip_name = "Empty"; //chip_name_fetch(); 
    chipX->chip_index = NULL;
    chipX->chip_next = NULL; 
    chipX->file_num = 0;
    // do for files_num in chip, fetch from flash
    chipX->file_first = NULL; //file_init();
    chipX->project_parent = NULL;

    chipIterator++;
    return chipX;
}


    /*
    char* project_name; 
    uint8_t project_index; 
    project_struct* project_next;
    uint8_t chip_num; // total number of chips
    chip_struct* chip_first;
    */

project_struct* project_create(void) //TODO: render only existing chips
{
    project_struct* projectX = malloc(sizeof(project_struct));
    
    projectX->project_name = "Empty"; //project_name_fetch();
    projectX->project_index = NULL;
    projectX->project_next = NULL;
    projectX->chip_num = 0;
    // do for chip_num in project, fetch from flash
    projectX->chip_first = NULL; // chip_create();
    
    projectIterator++;
    return projectX; 
}


void clear_list(void) //TODO: This argument for future optimizing, write over exact text with black
{
      //SSD1351_draw_filled_rect(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color)
      SSD1351_draw_filled_rect(10, 53, 110, 20, COLOR_BLACK);
      SSD1351_draw_filled_rect(10, 80, 110, 20, COLOR_BLACK);
      SSD1351_draw_filled_rect(10, 105, 110, 20, COLOR_BLACK);
}


void rerender_list(int8_t itemHighlighted, uint8_t screenStack) // TODO: limit render to amount of existing items
{   

    if(itemHighlighted == 0)
    {
        clear_list();
        SSD1351_set_cursor(10,57);
        SSD1351_printf(COLOR_WHITE, curr_font, L_ item0);
        SSD1351_set_cursor(10,83);
        SSD1351_printf(COLOR_WHITE, curr_font, L_ item1);
        SSD1351_set_cursor(10,105);
        SSD1351_printf(COLOR_WHITE, curr_font, L_ item2);
        SSD1351_update();
    }
    else if(itemHighlighted == 1)
    {   
        clear_list();
        SSD1351_set_cursor(10,57);
        SSD1351_printf(COLOR_WHITE, curr_font, L_ item1);
        SSD1351_set_cursor(10,83);
        SSD1351_printf(COLOR_WHITE, curr_font, L_ item2);
        SSD1351_set_cursor(10,105);
        SSD1351_printf(COLOR_WHITE, curr_font, L_ item3);
        SSD1351_update();
    }
    else if(itemHighlighted == 2)
    {
        clear_list();
        SSD1351_set_cursor(10,57);
        SSD1351_printf(COLOR_WHITE, curr_font, L_ item2);
        SSD1351_set_cursor(10,83);
        SSD1351_printf(COLOR_WHITE, curr_font, L_ item3);
        SSD1351_set_cursor(10,105);
        SSD1351_printf(COLOR_WHITE, curr_font, L_ item4);
        SSD1351_update();
    }
    else if(itemHighlighted == 3)
    {
        clear_list();
        SSD1351_set_cursor(10,57);
        SSD1351_printf(COLOR_WHITE, curr_font, L_ item3);
        SSD1351_set_cursor(10,83);
        SSD1351_printf(COLOR_WHITE, curr_font, L_ item4);
        SSD1351_update();
    }
    else if(itemHighlighted == 4)
    {
        clear_list();
        SSD1351_set_cursor(10,57);
        SSD1351_printf(COLOR_WHITE, curr_font, L_ item4);
        SSD1351_update();
    }
}


void rerender_screen(int8_t itemHighlighted, int8_t selectedItem, uint8_t screenStack) 
{   
    switch(screenStack)
    {
        case project_screen: 
            L_ currentList = project;
            L_ header = projectHeader; //set initial values for display 
            L_ item0 = SYS_ project_first->project_name; 
            L_ item1 = SYS_ project_first->project_next->project_name;
            L_ item2 = SYS_ project_first->project_next->project_next->project_name;
//            L_ item3 = SYS_ project_first->project_next->project_next->project_next->project_name;
//            L_ item4 = SYS_ project_first->project_next->project_next->project_next->project_next->project_name;
            break;

        case chip_screen: //chip screen
            L_ currentList = chip;
            L_ header = chipHeader;
            if(selectedItem == 0)
            {
                selectedProject = 0; 
                L_ item0 = SYS_ project_first->chip_first->chip_name;
//                L_ item1 = SYS_ project_first->chip_first->chip_next->chip_name;
//                L_ item2 = NULL;
//                L_ item3 = NULL;
//                L_ item4 = NULL;
            }
//            else if(selectedItem == 1)
//            {
//                selectedProject = 1; 
//                L_ item0 = SYS_ project_first->project_next->chip_first->chip_name;
//                L_ item1 = SYS_ project_first->project_next->chip_first->chip_next->chip_name;
//                L_ item2 = NULL;
//                L_ item3 = NULL;
//                L_ item4 = NULL;
//            }
//            else if(selectedItem == 2)
//            {
//                selectedProject = 2; 
//                L_ item0 = SYS_ project_first->project_next->project_next->chip_first->chip_name;
//                L_ item1 = SYS_ project_first->project_next->project_next->chip_first->chip_next->chip_name;
//                L_ item2 = NULL;
//                L_ item3 = NULL;
//                L_ item4 = NULL;
//            }
//            else if(selectedItem == 3)
//            {
//                selectedProject = 3; 
//                L_ item0 = SYS_ project_first->project_next->project_next->project_next->chip_first->chip_name;
//                L_ item1 = SYS_ project_first->project_next->project_next->project_next->chip_first->chip_next->chip_name;
//                L_ item2 = NULL;
//                L_ item3 = NULL;
//                L_ item4 = NULL;
//            }
//            else if(selectedItem == 4)
//            {
//                selectedProject = 4; 
//                L_ item0 = SYS_ project_first->project_next->project_next->project_next->project_next->chip_first->chip_name;
//                L_ item1 = SYS_ project_first->project_next->project_next->project_next->project_next->chip_first->chip_next->chip_name;
//                L_ item2 = NULL;
//                L_ item3 = NULL;
//                L_ item4 = NULL;
//            }
            break;

        case file_screen: //file screen
            L_ currentList = file;
            L_ header = fileHeader;
            if(selectedItem == 0 && selectedProject == 0) // project 1 chip 1 selected
            {
                L_ item0 = SYS_ project_first->chip_first->file_first->file_name;
//                L_ item1 = SYS_ project_first->chip_first->file_first->file_next->file_name;
//                L_ item2 = NULL;
//                L_ item3 = NULL;
//                L_ item4 = NULL;
            }
//            else if(selectedItem == 1 && selectedProject == 0) // project 1 chip 2 selected
//            {
//                L_ item0 = SYS_ project_first->chip_first->chip_next->file_first->file_name;
//                L_ item1 = SYS_ project_first->chip_first->chip_next->file_first->file_next->file_name;
//                L_ item2 = NULL;
//                L_ item3 = NULL;
//                L_ item4 = NULL;
//            }
//            else if(selectedItem == 0 && selectedProject == 1) // project 2 chip 1 selected
//            {
//                L_ item0 = SYS_ project_first->project_next->chip_first->file_first->file_name;
//                L_ item1 = SYS_ project_first->project_next->chip_first->file_first->file_next->file_name;
//                L_ item2 = NULL;
//                L_ item3 = NULL;
//                L_ item4 = NULL;
//            }
//            else if(selectedItem == 1 && selectedProject == 1) // project 2 chip 2 selected
//            {
//                L_ item0 = SYS_ project_first->project_next->chip_first->chip_next->file_first->file_name;
//                L_ item1 = SYS_ project_first->project_next->chip_first->chip_next->file_first->file_next->file_name;
//                L_ item2 = NULL;
//                L_ item3 = NULL;
//                L_ item4 = NULL;
//            }
//            else if(selectedItem == 0 && selectedProject == 2) // project 3 chip 1 selected
//            {
//                L_ item0 = SYS_ project_first->project_next->project_next->chip_first->file_first->file_name;
//                L_ item1 = SYS_ project_first->project_next->project_next->chip_first->file_first->file_next->file_name;
//                L_ item2 = NULL;
//                L_ item3 = NULL;
//                L_ item4 = NULL;
//            }
//            else if(selectedItem == 1 && selectedProject == 2) // project 3 chip 2 selected
//            {
//                L_ item0 = SYS_ project_first->project_next->project_next->chip_first->chip_next->file_first->file_name; //runs out of filenames here
//                L_ item1 = SYS_ project_first->project_next->project_next->chip_first->chip_next->file_first->file_next->file_name;
//                L_ item2 = NULL;
//                L_ item3 = NULL;
//                L_ item4 = NULL;
//            }
//            else if(selectedItem == 0 && selectedProject == 3) // project 4 chip 1 selected
//            {
//                L_ item0 = SYS_ project_first->project_next->project_next->project_next->chip_first->file_first->file_name;
//                L_ item1 = SYS_ project_first->project_next->project_next->project_next->chip_first->file_first->file_next->file_name;
//                L_ item2 = NULL;
//                L_ item3 = NULL;
//                L_ item4 = NULL;
//            }
//            else if(selectedItem == 1 && selectedProject == 3) // project 4 chip 2 selected
//            {
//                L_ item0 = SYS_ project_first->project_next->project_next->project_next->chip_first->chip_next->file_first->file_name;
//                L_ item1 = SYS_ project_first->project_next->project_next->project_next->chip_first->chip_next->file_first->file_next->file_name;
//                L_ item2 = NULL;
//                L_ item3 = NULL;
//                L_ item4 = NULL;
//            }
//            else if(selectedItem == 0 && selectedProject == 4) // project 5 chip 1 selected
//            {
//                L_ item0 = SYS_ project_first->project_next->project_next->project_next->project_next->chip_first->file_first->file_name;
//                L_ item1 = SYS_ project_first->project_next->project_next->project_next->project_next->chip_first->file_first->file_next->file_name;
//                L_ item2 = NULL;
//                L_ item3 = NULL;
//                L_ item4 = NULL;
//            }
//            else if(selectedItem == 1 && selectedProject == 4) // project 5 chip 2 selected
//            {
//                L_ item0 = SYS_ project_first->project_next->project_next->project_next->project_next->chip_first->chip_next->file_first->file_name;
//                L_ item1 = SYS_ project_first->project_next->project_next->project_next->project_next->chip_first->chip_next->file_first->file_next->file_name;
//                L_ item2 = NULL;
//                L_ item3 = NULL;
//                L_ item4 = NULL;
//            }
            break; 

        case exe_screen:
            break; 

        default:
            break; 
    }

    rerender_list(itemHighlighted,screenStack);

    if(L_ boxPresent == false)
    {
        draw_selection_box();
    }

    if(L_ headerPresent == false)
    {
        draw_header();
    }
}